nxp-mcuxpresso/mcux-soc-svd/MCXA155/MCXA155.xml
        <register>
          <name>QDC0_PHASEA</name>
          <description>QDC0 Trigger Input Connections</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>QDC0 input connections</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>AOI0_OUT0 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>AOI0_OUT1 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>AOI0_OUT2 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>AOI0_OUT3 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>CMP1_OUT input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CTimer0_MAT3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>CTimer2_MAT2 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>CTimer2_MAT3 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>PWM0_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>PWM0_SM0_MUX_TRIG1 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>PWM0_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>PWM0_SM1_MUX_TRIG1 input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>PWM0_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>PWM0_SM2_MUX_TRIG1 input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>GPIO0 Pin Event Trig 0 is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>GPIO1 Pin Event Trig 0 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>GPIO2 Pin Event Trig 0 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>GPIO3 Pin Event Trig 0 input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>GPIO4 Pin Event Trig 0 input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>AOI1_OUT0 input is selected</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>AOI1_OUT1 input is selected</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>AOI1_OUT2 input is selected</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>AOI1_OUT3 input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>CTimer3_MAT2 input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>CTimer3_MAT3 input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>CTimer4_MAT2 input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>CTimer4_MAT3 End of Frame input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>PWM1_SM0_OUT_TRIG0 input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>PWM1_SM0_OUT_TRIG1 input is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>PWM1_SM1_OUT_TRIG0 input is selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>PWM1_SM1_OUT_TRIG1 input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>PWM1_SM2_OUT_TRIG0 input is selected</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>PWM1_SM2_OUT_TRIG1 input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QDC0_ICAP1</name>
          <description>QDC0 Trigger Input Connections</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>QDC0 input connections</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>AOI0_OUT0 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>AOI0_OUT1 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>AOI0_OUT2 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>AOI0_OUT3 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>CMP1_OUT input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CTimer0_MAT3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>CTimer2_MAT2 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>CTimer2_MAT3 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>PWM0_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>PWM0_SM0_MUX_TRIG1 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>PWM0_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>PWM0_SM1_MUX_TRIG1 input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>PWM0_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>PWM0_SM2_MUX_TRIG1 input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>GPIO0 Pin Event Trig 0 is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>GPIO1 Pin Event Trig 0 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>GPIO2 Pin Event Trig 0 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>GPIO3 Pin Event Trig 0 input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>GPIO4 Pin Event Trig 0 input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>AOI1_OUT0 input is selected</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>AOI1_OUT1 input is selected</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>AOI1_OUT2 input is selected</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>AOI1_OUT3 input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>CTimer3_MAT2 input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>CTimer3_MAT3 input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>CTimer4_MAT2 input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>CTimer4_MAT3 End of Frame input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>PWM1_SM0_OUT_TRIG0 input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>PWM1_SM0_OUT_TRIG1 input is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>PWM1_SM1_OUT_TRIG0 input is selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>PWM1_SM1_OUT_TRIG1 input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>PWM1_SM2_OUT_TRIG0 input is selected</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>PWM1_SM2_OUT_TRIG1 input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
